MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13256/mcu.h
// Register: PWM2S1P2
#define PWM2S1P2 PWM2S1P2
extern volatile unsigned short          PWM2S1P2            __at(0x599);
#ifndef _LIB_BUILD
asm("PWM2S1P2 equ 0599h");
#endif

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
extern volatile unsigned char           PWM2S1P2L           __at(0x599);
#ifndef _LIB_BUILD
asm("PWM2S1P2L equ 0599h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
    struct {
        unsigned S1P2L                  :8;
    };
} PWM2S1P2Lbits_t;
extern volatile PWM2S1P2Lbits_t PWM2S1P2Lbits __at(0x599);
// bitfield macros
#define _PWM2S1P2L_P2L_POSN                                 0x0
#define _PWM2S1P2L_P2L_POSITION                             0x0
#define _PWM2S1P2L_P2L_SIZE                                 0x8
#define _PWM2S1P2L_P2L_LENGTH                               0x8
#define _PWM2S1P2L_P2L_MASK                                 0xFF
#define _PWM2S1P2L_S1P2L_POSN                               0x0
#define _PWM2S1P2L_S1P2L_POSITION                           0x0
#define _PWM2S1P2L_S1P2L_SIZE                               0x8
#define _PWM2S1P2L_S1P2L_LENGTH                             0x8
#define _PWM2S1P2L_S1P2L_MASK                               0xFF

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
extern volatile unsigned char           PWM2S1P2H           __at(0x59A);
#ifndef _LIB_BUILD
asm("PWM2S1P2H equ 059Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :8;
    };
    struct {
        unsigned S1P2H                  :8;
    };
} PWM2S1P2Hbits_t;
extern volatile PWM2S1P2Hbits_t PWM2S1P2Hbits __at(0x59A);
// bitfield macros
#define _PWM2S1P2H_P2H_POSN                                 0x0
#define _PWM2S1P2H_P2H_POSITION                             0x0
#define _PWM2S1P2H_P2H_SIZE                                 0x8
#define _PWM2S1P2H_P2H_LENGTH                               0x8
#define _PWM2S1P2H_P2H_MASK                                 0xFF
#define _PWM2S1P2H_S1P2H_POSN                               0x0
#define _PWM2S1P2H_S1P2H_POSITION                           0x0
#define _PWM2S1P2H_S1P2H_SIZE                               0x8
#define _PWM2S1P2H_S1P2H_LENGTH                             0x8
#define _PWM2S1P2H_S1P2H_MASK                               0xFF

// Register: CLCnCON
#define CLCnCON CLCnCON
extern volatile unsigned char           CLCnCON             __at(0x68C);
#ifndef _LIB_BUILD
asm("CLCnCON equ 068Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} CLCnCONbits_t;
extern volatile CLCnCONbits_t CLCnCONbits __at(0x68C);
// bitfield macros
#define _CLCnCON_MODE_POSN                                  0x0
#define _CLCnCON_MODE_POSITION                              0x0
#define _CLCnCON_MODE_SIZE                                  0x3
#define _CLCnCON_MODE_LENGTH                                0x3
#define _CLCnCON_MODE_MASK                                  0x7
#define _CLCnCON_INTN_POSN                                  0x3
#define _CLCnCON_INTN_POSITION                              0x3
#define _CLCnCON_INTN_SIZE                                  0x1
#define _CLCnCON_INTN_LENGTH                                0x1
#define _CLCnCON_INTN_MASK                                  0x8
#define _CLCnCON_INTP_POSN                                  0x4
#define _CLCnCON_INTP_POSITION                              0x4
#define _CLCnCON_INTP_SIZE                                  0x1
#define _CLCnCON_INTP_LENGTH                                0x1
#define _CLCnCON_INTP_MASK                                  0x10
#define _CLCnCON_OUT_POSN                                   0x5
#define _CLCnCON_OUT_POSITION                               0x5
#define _CLCnCON_OUT_SIZE                                   0x1
#define _CLCnCON_OUT_LENGTH                                 0x1
#define _CLCnCON_OUT_MASK                                   0x20
#define _CLCnCON_EN_POSN                                    0x7
#define _CLCnCON_EN_POSITION                                0x7
#define _CLCnCON_EN_SIZE                                    0x1
#define _CLCnCON_EN_LENGTH                                  0x1
#define _CLCnCON_EN_MASK                                    0x80
#define _CLCnCON_MODE0_POSN                                 0x0
#define _CLCnCON_MODE0_POSITION                             0x0
#define _CLCnCON_MODE0_SIZE                                 0x1
#define _CLCnCON_MODE0_LENGTH                               0x1
#define _CLCnCON_MODE0_MASK                                 0x1
#define _CLCnCON_MODE1_POSN                                 0x1
#define _CLCnCON_MODE1_POSITION                             0x1
#define _CLCnCON_MODE1_SIZE                                 0x1
#define _CLCnCON_MODE1_LENGTH                               0x1
#define _CLCnCON_MODE1_MASK                                 0x2
#define _CLCnCON_MODE2_POSN                                 0x2
#define _CLCnCON_MODE2_POSITION                             0x2
#define _CLCnCON_MODE2_SIZE                                 0x1
#define _CLCnCON_MODE2_LENGTH                               0x1
#define _CLCnCON_MODE2_MASK                                 0x4

// Register: CLCnPOL
#define CLCnPOL CLCnPOL
extern volatile unsigned char           CLCnPOL             __at(0x68D);
#ifndef _LIB_BUILD
asm("CLCnPOL equ 068Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
} CLCnPOLbits_t;
