MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13256/mcu.h
extern volatile T2INPPSbits_t T2INPPSbits __at(0x1E19);
// bitfield macros
#define _T2INPPS_T2INPPS_POSN                               0x0
#define _T2INPPS_T2INPPS_POSITION                           0x0
#define _T2INPPS_T2INPPS_SIZE                               0x7
#define _T2INPPS_T2INPPS_LENGTH                             0x7
#define _T2INPPS_T2INPPS_MASK                               0x7F

// Register: T4INPPS
#define T4INPPS T4INPPS
extern volatile unsigned char           T4INPPS             __at(0x1E1A);
#ifndef _LIB_BUILD
asm("T4INPPS equ 01E1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T4INPPS                :7;
    };
} T4INPPSbits_t;
extern volatile T4INPPSbits_t T4INPPSbits __at(0x1E1A);
// bitfield macros
#define _T4INPPS_T4INPPS_POSN                               0x0
#define _T4INPPS_T4INPPS_POSITION                           0x0
#define _T4INPPS_T4INPPS_SIZE                               0x7
#define _T4INPPS_T4INPPS_LENGTH                             0x7
#define _T4INPPS_T4INPPS_MASK                               0x7F

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
extern volatile unsigned char           CCP1PPS             __at(0x1E1E);
#ifndef _LIB_BUILD
asm("CCP1PPS equ 01E1Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1PPS                :7;
    };
} CCP1PPSbits_t;
extern volatile CCP1PPSbits_t CCP1PPSbits __at(0x1E1E);
// bitfield macros
#define _CCP1PPS_CCP1PPS_POSN                               0x0
#define _CCP1PPS_CCP1PPS_POSITION                           0x0
#define _CCP1PPS_CCP1PPS_SIZE                               0x7
#define _CCP1PPS_CCP1PPS_LENGTH                             0x7
#define _CCP1PPS_CCP1PPS_MASK                               0x7F

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
extern volatile unsigned char           CCP2PPS             __at(0x1E1F);
#ifndef _LIB_BUILD
asm("CCP2PPS equ 01E1Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2PPS                :7;
    };
} CCP2PPSbits_t;
extern volatile CCP2PPSbits_t CCP2PPSbits __at(0x1E1F);
// bitfield macros
#define _CCP2PPS_CCP2PPS_POSN                               0x0
#define _CCP2PPS_CCP2PPS_POSITION                           0x0
#define _CCP2PPS_CCP2PPS_SIZE                               0x7
#define _CCP2PPS_CCP2PPS_LENGTH                             0x7
#define _CCP2PPS_CCP2PPS_MASK                               0x7F

// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
extern volatile unsigned char           PWMIN0PPS           __at(0x1E24);
#ifndef _LIB_BUILD
asm("PWMIN0PPS equ 01E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWMIN0PPS              :7;
    };
} PWMIN0PPSbits_t;
extern volatile PWMIN0PPSbits_t PWMIN0PPSbits __at(0x1E24);
// bitfield macros
#define _PWMIN0PPS_PWMIN0PPS_POSN                           0x0
#define _PWMIN0PPS_PWMIN0PPS_POSITION                       0x0
#define _PWMIN0PPS_PWMIN0PPS_SIZE                           0x7
#define _PWMIN0PPS_PWMIN0PPS_LENGTH                         0x7
#define _PWMIN0PPS_PWMIN0PPS_MASK                           0x7F

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
extern volatile unsigned char           PWMIN1PPS           __at(0x1E25);
#ifndef _LIB_BUILD
asm("PWMIN1PPS equ 01E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWMIN1PPS              :7;
    };
} PWMIN1PPSbits_t;
extern volatile PWMIN1PPSbits_t PWMIN1PPSbits __at(0x1E25);
// bitfield macros
#define _PWMIN1PPS_PWMIN1PPS_POSN                           0x0
#define _PWMIN1PPS_PWMIN1PPS_POSITION                       0x0
#define _PWMIN1PPS_PWMIN1PPS_SIZE                           0x7
#define _PWMIN1PPS_PWMIN1PPS_LENGTH                         0x7
#define _PWMIN1PPS_PWMIN1PPS_MASK                           0x7F

// Register: PWM1ERSPPS
#define PWM1ERSPPS PWM1ERSPPS
extern volatile unsigned char           PWM1ERSPPS          __at(0x1E26);
#ifndef _LIB_BUILD
asm("PWM1ERSPPS equ 01E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1ERSPPS             :7;
    };
} PWM1ERSPPSbits_t;
extern volatile PWM1ERSPPSbits_t PWM1ERSPPSbits __at(0x1E26);
// bitfield macros
#define _PWM1ERSPPS_PWM1ERSPPS_POSN                         0x0
#define _PWM1ERSPPS_PWM1ERSPPS_POSITION                     0x0
#define _PWM1ERSPPS_PWM1ERSPPS_SIZE                         0x7
#define _PWM1ERSPPS_PWM1ERSPPS_LENGTH                       0x7
#define _PWM1ERSPPS_PWM1ERSPPS_MASK                         0x7F

// Register: PWM2ERSPPS
#define PWM2ERSPPS PWM2ERSPPS
extern volatile unsigned char           PWM2ERSPPS          __at(0x1E27);
#ifndef _LIB_BUILD
asm("PWM2ERSPPS equ 01E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM2ERSPPS             :7;
    };
} PWM2ERSPPSbits_t;
extern volatile PWM2ERSPPSbits_t PWM2ERSPPSbits __at(0x1E27);
// bitfield macros
#define _PWM2ERSPPS_PWM2ERSPPS_POSN                         0x0
#define _PWM2ERSPPS_PWM2ERSPPS_POSITION                     0x0
#define _PWM2ERSPPS_PWM2ERSPPS_SIZE                         0x7
#define _PWM2ERSPPS_PWM2ERSPPS_LENGTH                       0x7
#define _PWM2ERSPPS_PWM2ERSPPS_MASK                         0x7F

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
extern volatile unsigned char           CLCIN0PPS           __at(0x1E3D);
#ifndef _LIB_BUILD
asm("CLCIN0PPS equ 01E3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN0PPS              :7;
    };
} CLCIN0PPSbits_t;
extern volatile CLCIN0PPSbits_t CLCIN0PPSbits __at(0x1E3D);
// bitfield macros
#define _CLCIN0PPS_CLCIN0PPS_POSN                           0x0
#define _CLCIN0PPS_CLCIN0PPS_POSITION                       0x0
#define _CLCIN0PPS_CLCIN0PPS_SIZE                           0x7
#define _CLCIN0PPS_CLCIN0PPS_LENGTH                         0x7
#define _CLCIN0PPS_CLCIN0PPS_MASK                           0x7F

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
extern volatile unsigned char           CLCIN1PPS           __at(0x1E3E);
#ifndef _LIB_BUILD
asm("CLCIN1PPS equ 01E3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN1PPS              :7;
    };
} CLCIN1PPSbits_t;
extern volatile CLCIN1PPSbits_t CLCIN1PPSbits __at(0x1E3E);
// bitfield macros
#define _CLCIN1PPS_CLCIN1PPS_POSN                           0x0
#define _CLCIN1PPS_CLCIN1PPS_POSITION                       0x0
#define _CLCIN1PPS_CLCIN1PPS_SIZE                           0x7
#define _CLCIN1PPS_CLCIN1PPS_LENGTH                         0x7
#define _CLCIN1PPS_CLCIN1PPS_MASK                           0x7F

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
extern volatile unsigned char           CLCIN2PPS           __at(0x1E3F);
#ifndef _LIB_BUILD
asm("CLCIN2PPS equ 01E3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN2PPS              :7;
    };
} CLCIN2PPSbits_t;
